AI-FanGe/A-Ball-Robot-based-on-Esp32/physical_remote/esp32_joystick_remote/esp32_joystick_remote.ino
/*
  Seeed Studio XIAO ESP32-S3 实体摇杆遥控器

  接线（摇杆模块 → XIAO ESP32-S3 右侧，与 GND/3.3V 同侧集约）：
    摇杆 GND  → XIAO GND
    摇杆 +5V  → XIAO 3.3V-OUT   （务必接 3.3V，不要接 5V/VBUS）
    摇杆 VRx  → XIAO D10 / A10 / GPIO9  （X 轴，左右）
    摇杆 VRy  → XIAO D9 / A9 / GPIO8    （Y 轴，前后）
    摇杆 SW   → XIAO D8 / A8 / GPIO7    （按下按键，内部上拉，按下为 LOW）

  功能：
    - 读取摇杆，映射为 throttle / steering（-100 ~ 100）
    - 优先通过 ESP-NOW 直连发送到小车 ESP32，HTTP /drive 作为备用
    - 按住摇杆时 120ms 心跳保活，避免小车看门狗误判松手
    - XIAO ESP32S3 Sense 板载麦克风 16kHz/20ms PCM 流式上传到语音识别 sidecar
    - SW 短按 → 设当前 IMU 方向为绝对前方；按住 1s 以上 → 重新校准中心
    - 本机 80 端口提供 /status，供 Python WebUI 读取遥测

  Arduino IDE 依赖：
    - esp32 开发板包（XIAO ESP32S3）
    - ArduinoWebsockets
*/

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include <esp_now.h>
#include <esp_arduino_version.h>
#include <esp_wifi.h>
#include <ESP_I2S.h>
#include <ArduinoWebsockets.h>

using namespace websockets;

// ============ 请按你的网络修改 ============
const char* WIFI_SSID = "YOUR_WIFI_SSID";
const char* WIFI_PASSWORD = "YOUR_WIFI_PASSWORD";
const char* REMOTE_HOSTNAME = "esp32-joystick-remote";

// 小车（电机控制板）ESP32 的 IP，与 app.py 里 ESP32_BASE_URL 一致
const char* ROBOT_ESP32_IP = "192.168.152.11";
const uint16_t ROBOT_ESP32_PORT = 80;
const bool DEFAULT_ROBOT_FORWARD_ENABLED = true;  // 上电后默认允许摇杆直接控制小车；可通过 WebUI /forward 关闭。

// 语音方向控制 sidecar（运行 voice_drive_realtime.py 的电脑）
const bool VOICE_AUDIO_ENABLED = true;
const char* VOICE_SERVER_HOST = "192.168.152.216";
const uint16_t VOICE_SERVER_PORT = 8091;
const char* VOICE_WS_PATH = "/ws_voice_audio";

const bool USE_STATIC_IP = false;
IPAddress localIp(192, 168, 152, 60);
IPAddress gateway(192, 168, 152, 1);
IPAddress subnet(255, 255, 255, 0);
IPAddress dns1(192, 168, 152, 1);

// ============ 引脚（右侧 D8~D10，与 GND/3.3V 同侧） ============
const int PIN_JOY_X = 9;   // D10 / A10 / GPIO9
const int PIN_JOY_Y = 8;   // D9 / A9 / GPIO8
const int PIN_JOY_SW = 7;  // D8 / A8 / GPIO7

// XIAO ESP32S3 Sense 板载 PDM 麦克风。若是非 Sense 版本，请把 VOICE_AUDIO_ENABLED 设为 false。
const int I2S_MIC_CLOCK_PIN = 42;
const int I2S_MIC_DATA_PIN = 41;

// ============ 摇杆参数 ============
const int ADC_MAX = 4095;
const int DEAD_ZONE = 12;       // 实体摇杆中心会漂移，稍大死区避免无操作误触发。
const int ADC_FILTER_SAMPLES = 8;
const float JOYSTICK_FILTER_ALPHA = 0.22f; // 简单一阶低通：越大越跟手，越小越稳。
const int JOYSTICK_OUTPUT_HOLD_DELTA = 3;  // 输出变化小于该值时保持上一档，减少手抖跳变。
const int CALIB_SAMPLES = 64;
const int SAMPLE_INTERVAL_MS = 5;
const uint32_t DRIVE_SEND_INTERVAL_MS = 45;   // 与 WebUI 节流一致
const uint32_t DRIVE_KEEPALIVE_MS = 120;      // 看门狗保活
const uint32_t HTTP_TIMEOUT_MS = 120;         // 小车不可达时快速失败，避免卡住摇杆/WebUI。
const uint32_t ROBOT_FAIL_BACKOFF_MS = 600;   // 连不上小车时不要每一帧都阻塞重试。
const uint32_t STATUS_PRINT_MS = 100;   // 有操作时每 100ms 打印一次
const uint32_t WIFI_CONNECT_TIMEOUT_MS = 15000;
const uint32_t WIFI_RECONNECT_INTERVAL_MS = 3000;
const uint32_t MDNS_RETRY_MS = 5000;
const int CALIBRATION_VERSION = 2;
const int DEFAULT_CENTER_X = 2746;
const int DEFAULT_CENTER_Y = 2814;
const int DEFAULT_CAL_X_MIN = 146;
const int DEFAULT_CAL_X_MAX = 4095;
const int DEFAULT_CAL_Y_MIN = 292;
const int DEFAULT_CAL_Y_MAX = 4095;
const int DEFAULT_CONTROL_ROTATION_DEG = 0;   // 0/90/180/270，用于让手柄方向对齐小车方向。
const uint32_t BUTTON_DEBOUNCE_MS = 40;
const uint32_t BUTTON_CENTER_CAL_MS = 1000;
const uint32_t DIRECT_ACK_FRESH_MS = 1500;
const uint32_t DIRECT_PEER_STALE_MS = 3500;
const uint32_t DIRECT_DISCOVERY_MS = 700;
const int VOICE_SAMPLE_RATE = 16000;
const int VOICE_CHUNK_MS = 20;
const int VOICE_BYTES_PER_CHUNK = VOICE_SAMPLE_RATE * VOICE_CHUNK_MS / 1000 * 2;
const uint32_t VOICE_WS_RETRY_MS = 3000;

const uint32_t DIRECT_MAGIC = 0x52444345UL; // "ECDR" little-endian: ESP32 car direct remote
const uint8_t DIRECT_VERSION = 1;
const uint8_t DIRECT_TYPE_HELLO = 1;
const uint8_t DIRECT_TYPE_DRIVE = 2;
const uint8_t DIRECT_TYPE_STOP = 3;
const uint8_t DIRECT_TYPE_CONFIG = 4;
const uint8_t DIRECT_TYPE_ACK = 5;
const uint8_t DIRECT_FLAG_HEADING_HOLD = 0x01;
const uint8_t DIRECT_FLAG_SET_ABS_FORWARD = 0x02;
const uint8_t DIRECT_BROADCAST_MAC[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};

struct DirectControlPacket {
  uint32_t magic;
  uint8_t version;
  uint8_t type;
  uint16_t seq;
  int16_t throttle;
  int16_t steering;
  uint8_t assistMode;
  uint8_t flags;
  uint32_t ms;
} __attribute__((packed));

struct AudioChunk {
  size_t n;
  uint8_t data[VOICE_BYTES_PER_CHUNK];
};

WebServer server(80);
Preferences prefs;
I2SClass i2sIn;
WebsocketsClient wsVoice;
QueueHandle_t qAudio = nullptr;

int centerX = DEFAULT_CENTER_X;
int centerY = DEFAULT_CENTER_Y;
int calXMin = DEFAULT_CAL_X_MIN;
int calXMax = DEFAULT_CAL_X_MAX;
int calYMin = DEFAULT_CAL_Y_MIN;
int calYMax = DEFAULT_CAL_Y_MAX;
volatile int rawX = 0;
volatile int rawY = 0;
volatile float physicalNormX = 0.0f; // 物理摇杆位置 -100~100（端点 remap 后，未旋转）
volatile float physicalNormY = 0.0f;
volatile float normX = 0.0f;         // 控制向量 -100~100（按 controlRotationDeg 旋转后）
volatile float normY = 0.0f;
volatile int throttleRaw = 0;
volatile int steeringRaw = 0;
volatile float vectorMag = 0.0f;
volatile int throttle = 0;
volatile int steering = 0;
volatile bool driveActive = false;
volatile bool buttonPressed = false;
volatile bool robotForwardEnabled = DEFAULT_ROBOT_FORWARD_ENABLED;
volatile int controlRotationDeg = DEFAULT_CONTROL_ROTATION_DEG;
volatile int remoteAssistMode = 1;   // 1=相对方向矫正，2=绝对方向模式
volatile bool robotReachable = false;
volatile int lastHttpCode = 0;
volatile uint32_t driveSentCount = 0;
volatile uint32_t driveFailCount = 0;
volatile uint32_t driveSkipCount = 0;
volatile uint32_t lastDriveSentMs = 0;
volatile uint32_t lastRobotAttemptMs = 0;
volatile uint32_t lastRobotResponseMs = 0;
volatile uint32_t wifiReconnectCount = 0;
String lastRobotError = "";

volatile bool directReady = false;
volatile bool directPeerKnown = false;
volatile uint32_t directSendCount = 0;
volatile uint32_t directFailCount = 0;
volatile uint32_t directAckCount = 0;
volatile uint32_t directBadCount = 0;
volatile uint32_t directLastSendMs = 0;
volatile uint32_t directLastAckMs = 0;
volatile uint16_t directLastAckSeq = 0;
volatile uint8_t directLastAckType = 0;
volatile uint32_t directPeerResetCount = 0;
uint16_t directSeq = 0;
uint32_t lastDirectDiscoveryMs = 0;
uint8_t directPeerMac[6] = {0};

