AI-FanGe/A-Ball-Robot-based-on-Esp32/physical_remote/esp32_joystick_remote/esp32_joystick_remote.ino
volatile bool voiceMicReady = false;
volatile bool voiceWsReady = false;
volatile bool voiceStreamEnabled = false;
volatile uint32_t voiceAudioSentCount = 0;
volatile uint32_t voiceAudioFailCount = 0;
volatile uint32_t voiceLastConnectMs = 0;
volatile uint32_t voiceLastChunkMs = 0;
String voiceLastMessage = "";

float filteredControlX = 0.0f;
float filteredControlY = 0.0f;
bool joystickFilterReady = false;
int heldThrottle = 0;
int heldSteering = 0;
bool joystickOutputHoldReady = false;
uint32_t lastKeepaliveMs = 0;
uint32_t lastStatusPrintMs = 0;
uint32_t lastWifiReconnectAttemptMs = 0;
uint32_t lastMdnsAttemptMs = 0;
bool mdnsStarted = false;
int lastPrintedThrottle = 0;
int lastPrintedSteering = 0;
int pendingThrottle = 0;
int pendingSteering = 0;
bool hasPendingDrive = false;
bool lastButtonPressed = false;
bool buttonLongPressHandled = false;
uint32_t buttonPressedAtMs = 0;

static void saveCalibration();
static void loadCalibration();

static int readAxis(int pin) {
  long sum = 0;
  for (int i = 0; i < ADC_FILTER_SAMPLES; i++) {
    sum += analogRead(pin);
    delayMicroseconds(200);
  }
  return (int)(sum / ADC_FILTER_SAMPLES);
}

static float remapAxis(int value, int center, int minValue, int maxValue) {
  int lowSpan = max(center - minValue, 1);
  int highSpan = max(maxValue - center, 1);
  if (value >= center) {
    return constrain((float)(value - center) / highSpan, 0.0f, 1.0f);
  }
  return -constrain((float)(center - value) / lowSpan, 0.0f, 1.0f);
}

static int normalizeRotation(int degrees) {
  int r = degrees % 360;
  if (r < 0) r += 360;
  if (r < 45) return 0;
  if (r < 135) return 90;
  if (r < 225) return 180;
  if (r < 315) return 270;
  return 0;
}

static void rotateControlVector(float inX, float inY, float& outX, float& outY) {
  switch (normalizeRotation(controlRotationDeg)) {
    case 90:
      outX = inY;
      outY = -inX;
      break;
    case 180:
      outX = -inX;
      outY = -inY;
      break;
    case 270:
      outX = -inY;
      outY = inX;
      break;
    default:
      outX = inX;
      outY = inY;
      break;
  }
}

static void mapJoystickToDrive(int axisX, int axisY, int& outThrottle, int& outSteering) {
  // 与 WebUI 圆形摇杆一致：上推为正 throttle，右推为负 steering。
  float px = remapAxis(axisX, centerX, calXMin, calXMax);
  float py = -remapAxis(axisY, centerY, calYMin, calYMax);
  float cx = 0.0f;
  float cy = 0.0f;
  rotateControlVector(px, py, cx, cy);

  float mag = hypotf(cx, cy);
  float dead = DEAD_ZONE / 100.0f;
  if (mag < dead) {
    filteredControlX = 0.0f;
    filteredControlY = 0.0f;
    joystickFilterReady = false;
  } else if (!joystickFilterReady) {
    filteredControlX = cx;
    filteredControlY = cy;
    joystickFilterReady = true;
  } else {
    filteredControlX += (cx - filteredControlX) * JOYSTICK_FILTER_ALPHA;
    filteredControlY += (cy - filteredControlY) * JOYSTICK_FILTER_ALPHA;
  }

  physicalNormX = px * 100.0f;
  physicalNormY = py * 100.0f;
  normX = filteredControlX * 100.0f;
  normY = filteredControlY * 100.0f;
  throttleRaw = (int)lroundf(normY);
  steeringRaw = (int)lroundf(-normX);
  vectorMag = hypotf(normX, normY);
  int candidateThrottle = constrain(throttleRaw, -100, 100);
  int candidateSteering = constrain(steeringRaw, -100, 100);
  if (candidateThrottle == 0 && candidateSteering == 0) {
    heldThrottle = 0;
    heldSteering = 0;
    joystickOutputHoldReady = false;
  } else if (!joystickOutputHoldReady) {
    heldThrottle = candidateThrottle;
    heldSteering = candidateSteering;
    joystickOutputHoldReady = true;
  } else {
    if (candidateThrottle == 0 || abs(candidateThrottle - heldThrottle) >= JOYSTICK_OUTPUT_HOLD_DELTA) {
      heldThrottle = candidateThrottle;
    }
    if (candidateSteering == 0 || abs(candidateSteering - heldSteering) >= JOYSTICK_OUTPUT_HOLD_DELTA) {
      heldSteering = candidateSteering;
    }
  }
  outThrottle = heldThrottle;
  outSteering = heldSteering;
}

static bool isOperating() {
  return driveActive || buttonPressed;
}

static void maybePrintDriveStatus() {
  // 测试通过后默认不在串口持续打印摇杆坐标，避免串口监视器刷屏。
}

static String macToString(const uint8_t* mac) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

static String jsonEscape(String value) {
  value.replace("\\", "\\\\");
  value.replace("\"", "\\\"");
  value.replace("\n", "\\n");
  value.replace("\r", "\\r");
  return value;
}

static bool directAckFresh() {
  return directReady && directPeerKnown && (millis() - directLastAckMs) <= DIRECT_ACK_FRESH_MS;
}

static void forgetDirectPeerIfStale() {
  if (!directPeerKnown) {
    return;
  }
  uint32_t now = millis();
  if (directLastAckMs == 0 || now - directLastAckMs <= DIRECT_PEER_STALE_MS) {
    return;
  }
  directPeerKnown = false;
  directPeerResetCount++;
}

static void ensureDirectPeer(const uint8_t* mac) {
  if (esp_now_is_peer_exist(mac)) {
    return;
  }

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, mac, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  peerInfo.ifidx = WIFI_IF_STA;
  esp_now_add_peer(&peerInfo);
}

static void rememberDirectPeer(const uint8_t* mac) {
  memcpy(directPeerMac, mac, 6);
  directPeerKnown = true;
}

static bool sendDirectPacket(uint8_t type, int t = 0, int s = 0, bool setAbsForward = false, bool forceBroadcast = false) {
  if (!directReady) {
    return false;
  }

  DirectControlPacket packet = {};
  packet.magic = DIRECT_MAGIC;
  packet.version = DIRECT_VERSION;
  packet.type = type;
  packet.seq = ++directSeq;
  packet.throttle = constrain(t, -100, 100);
  packet.steering = constrain(s, -100, 100);
  packet.assistMode = constrain(remoteAssistMode, 1, 2);
  packet.flags = DIRECT_FLAG_HEADING_HOLD | (setAbsForward ? DIRECT_FLAG_SET_ABS_FORWARD : 0);
  packet.ms = millis();

  const uint8_t* target = (forceBroadcast || !directPeerKnown) ? DIRECT_BROADCAST_MAC : directPeerMac;
  ensureDirectPeer(target);
  esp_err_t result = esp_now_send(target, reinterpret_cast<uint8_t*>(&packet), sizeof(packet));
  directLastSendMs = millis();
  if (result == ESP_OK) {
    directSendCount++;
    return true;
  }

  directFailCount++;
  return false;
}

static void maybeSendDirectDiscovery() {
  if (!directReady) {
    return;
  }
  forgetDirectPeerIfStale();
  if (directAckFresh()) {
    return;
  }
  uint32_t now = millis();
  if (now - lastDirectDiscoveryMs < DIRECT_DISCOVERY_MS) {
    return;
  }
  lastDirectDiscoveryMs = now;
  sendDirectPacket(DIRECT_TYPE_HELLO, 0, 0, false, true);
}

