AI-FanGe/A-Ball-Robot-based-on-Esp32/physical_remote/esp32_joystick_remote/esp32_joystick_remote.ino
#if ESP_ARDUINO_VERSION_MAJOR >= 3
static void onDirectDataRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  const uint8_t* mac = info ? info->src_addr : nullptr;
#else
static void onDirectDataRecv(const uint8_t* mac, const uint8_t* data, int len) {
#endif
  if (mac == nullptr || data == nullptr || len != static_cast<int>(sizeof(DirectControlPacket))) {
    directBadCount++;
    return;
  }

  DirectControlPacket packet;
  memcpy(&packet, data, sizeof(packet));
  if (packet.magic != DIRECT_MAGIC || packet.version != DIRECT_VERSION || packet.type != DIRECT_TYPE_ACK) {
    directBadCount++;
    return;
  }

  rememberDirectPeer(mac);
  directAckCount++;
  directLastAckMs = millis();
  directLastAckSeq = packet.seq;
  directLastAckType = packet.type;
  robotReachable = true;
  lastRobotResponseMs = directLastAckMs;
}

static void setupDirectNow() {
  if (esp_now_init() != ESP_OK) {
    directReady = false;
    Serial.println("ESP-NOW 发送初始化失败");
    return;
  }

  ensureDirectPeer(DIRECT_BROADCAST_MAC);
  esp_now_register_recv_cb(onDirectDataRecv);
  directReady = true;

  uint8_t primaryChannel = 0;
  wifi_second_chan_t secondChannel = WIFI_SECOND_CHAN_NONE;
  esp_wifi_get_channel(&primaryChannel, &secondChannel);
  Serial.printf("ESP-NOW 发送已启动，MAC=%s，信道=%u\n", WiFi.macAddress().c_str(), primaryChannel);
}

static void initVoiceMic() {
  if (!VOICE_AUDIO_ENABLED) {
    voiceLastMessage = "voice disabled";
    return;
  }
  i2sIn.setPinsPdmRx(I2S_MIC_CLOCK_PIN, I2S_MIC_DATA_PIN);
  if (!i2sIn.begin(I2S_MODE_PDM_RX, VOICE_SAMPLE_RATE, I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO)) {
    voiceMicReady = false;
    voiceLastMessage = "mic init failed";
    Serial.println("语音麦克风初始化失败");
    return;
  }
  voiceMicReady = true;
  voiceLastMessage = "mic ready";
  Serial.println("语音麦克风已启动");
}

static void setupVoiceWebSocketCallbacks() {
  if (!VOICE_AUDIO_ENABLED) {
    return;
  }

  wsVoice.onEvent([](WebsocketsEvent event, String) {
    if (event == WebsocketsEvent::ConnectionOpened) {
      voiceWsReady = true;
      voiceStreamEnabled = true;
      voiceLastMessage = "voice ws connected";
      if (qAudio) xQueueReset(qAudio);
      wsVoice.send("START");
      Serial.println("语音 WebSocket 已连接");
    } else if (event == WebsocketsEvent::ConnectionClosed) {
      voiceWsReady = false;
      voiceStreamEnabled = false;
      voiceLastMessage = "voice ws disconnected";
      Serial.println("语音 WebSocket 已断开");
    }
  });

  wsVoice.onMessage([](WebsocketsMessage msg) {
    if (!msg.isText()) {
      return;
    }
    String s = msg.data();
    s.trim();
    voiceLastMessage = s;
    if (s == "START") {
      voiceStreamEnabled = true;
      if (qAudio) xQueueReset(qAudio);
      wsVoice.send("OK:STARTED");
    } else if (s == "STOP") {
      voiceStreamEnabled = false;
      wsVoice.send("OK:STOPPED");
    } else if (s == "RESTART") {
      voiceStreamEnabled = false;
      if (qAudio) xQueueReset(qAudio);
      delay(60);
      voiceStreamEnabled = true;
      wsVoice.send("START");
    } else if (s.startsWith("ERROR:")) {
      voiceStreamEnabled = false;
    }
  });
}

static void maintainVoiceSocket() {
  if (!VOICE_AUDIO_ENABLED || !voiceMicReady || WiFi.status() != WL_CONNECTED) {
    return;
  }
  uint32_t now = millis();
  if (!wsVoice.available() && now - voiceLastConnectMs >= VOICE_WS_RETRY_MS) {
    voiceLastConnectMs = now;
    voiceLastMessage = "voice ws connecting";
    if (wsVoice.connect(VOICE_SERVER_HOST, VOICE_SERVER_PORT, VOICE_WS_PATH)) {
      Serial.println("语音 WebSocket 发起连接");
    }
  }
  wsVoice.poll();
}

void taskVoiceMicCapture(void*) {
  const int samplesPerChunk = VOICE_BYTES_PER_CHUNK / 2;
  for (;;) {
    if (VOICE_AUDIO_ENABLED && voiceMicReady && voiceWsReady && voiceStreamEnabled) {
      AudioChunk chunk;
      chunk.n = VOICE_BYTES_PER_CHUNK;
      int16_t* out = reinterpret_cast<int16_t*>(chunk.data);
      int i = 0;
      int retry = 0;
      while (i < samplesPerChunk && retry < 1000) {
        int value = i2sIn.read();
        if (value == -1) {
          delay(1);
          retry++;
          continue;
        }
        out[i++] = static_cast<int16_t>(value);
        retry = 0;
      }
      if (i == samplesPerChunk && qAudio) {
        if (xQueueSend(qAudio, &chunk, 0) != pdPASS) {
          AudioChunk dump;
          xQueueReceive(qAudio, &dump, 0);
          xQueueSend(qAudio, &chunk, 0);
        }
      }
    } else {
      vTaskDelay(pdMS_TO_TICKS(10));
    }
  }
}

void taskVoiceMicUpload(void*) {
  for (;;) {
    if (VOICE_AUDIO_ENABLED && voiceWsReady && voiceStreamEnabled && qAudio) {
      AudioChunk chunk;
      if (xQueueReceive(qAudio, &chunk, pdMS_TO_TICKS(100)) == pdPASS) {
        bool ok = wsVoice.sendBinary(reinterpret_cast<const char*>(chunk.data), chunk.n);
        if (ok) {
          voiceAudioSentCount++;
          voiceLastChunkMs = millis();
        } else {
          voiceAudioFailCount++;
          voiceLastMessage = "voice binary send failed";
          wsVoice.close();
        }
      }
    } else {
      vTaskDelay(pdMS_TO_TICKS(10));
    }
  }
}

static bool postRobot(const String& path, int& httpCodeOut, String& errorOut) {
  lastRobotAttemptMs = millis();
  if (!robotForwardEnabled) {
    httpCodeOut = 0;
    errorOut = "robot forward disabled";
    return false;
  }
  if (WiFi.status() != WL_CONNECTED) {
    httpCodeOut = 0;
    errorOut = "wifi disconnected";
    return false;
  }

  HTTPClient http;
  String url = String("http://") + ROBOT_ESP32_IP + ":" + ROBOT_ESP32_PORT + path;
  http.setTimeout(HTTP_TIMEOUT_MS);
  http.begin(url);
  httpCodeOut = http.POST((uint8_t*)nullptr, 0);
  if (httpCodeOut > 0) {
    http.getString();
    errorOut = "";
    http.end();
    return httpCodeOut >= 200 && httpCodeOut < 300;
  }

  errorOut = http.errorToString(httpCodeOut);
  http.end();
  return false;
}

static bool robotSendAllowed(bool force) {
  if (force || robotReachable || driveFailCount == 0) {
    return true;
  }
  return (millis() - lastRobotAttemptMs) >= ROBOT_FAIL_BACKOFF_MS;
}

