AI-FanGe/A-Ball-Robot-based-on-Esp32/physical_remote/esp32_joystick_remote/esp32_joystick_remote.ino
static void sendDriveNow(int t, int s) {
  if (!robotForwardEnabled) {
    driveSkipCount++;
    lastRobotError = "robot forward disabled";
    return;
  }

  bool directWasFresh = directAckFresh();
  bool directSent = sendDirectPacket(DIRECT_TYPE_DRIVE, t, s);
  lastDriveSentMs = millis();
  driveSentCount++;
  if (directSent && directWasFresh) {
    robotReachable = true;
    lastRobotError = "";
    return;
  }

  if (!robotSendAllowed(false)) {
    driveSkipCount++;
    lastRobotError = directSent ? "espnow sent, http retry backoff" : "robot retry backoff";
    return;
  }

  String path = String("/drive?throttle=") + t + "&steering=" + s;
  int code = 0;
  String err;
  bool ok = postRobot(path, code, err);
  lastHttpCode = code;
  if (ok) {
    robotReachable = true;
    lastRobotResponseMs = millis();
    lastRobotError = "";
  } else {
    driveFailCount++;
    robotReachable = false;
    lastRobotError = err.length() ? err : String("http ") + code;
  }
}

static void sendConfigToRobot(bool setAbsForward = false) {
  if (!robotForwardEnabled) {
    lastRobotError = "robot forward disabled";
    return;
  }

  bool directWasFresh = directAckFresh();
  bool directSent = sendDirectPacket(DIRECT_TYPE_CONFIG, 0, 0, setAbsForward);
  if (directSent && directWasFresh) {
    robotReachable = true;
    lastRobotError = "";
    return;
  }

  String path = String("/config?assistMode=") + remoteAssistMode + "&headingHold=1";
  if (setAbsForward && remoteAssistMode == 2) {
    path += "&setAbsForward=1";
  }

  int code = 0;
  String err;
  bool ok = postRobot(path, code, err);
  lastHttpCode = code;
  if (ok) {
    robotReachable = true;
    lastRobotResponseMs = millis();
    lastRobotError = "";
  } else {
    driveFailCount++;
    robotReachable = false;
    lastRobotError = err.length() ? err : String("http ") + code;
  }
}

static void toggleAssistMode() {
  remoteAssistMode = (remoteAssistMode == 1) ? 2 : 1;
  saveCalibration();
  sendConfigToRobot(false);
}

static void setAbsForwardNow() {
  remoteAssistMode = 2;
  saveCalibration();
  sendConfigToRobot(true);
}

static void queueDrive(int t, int s) {
  pendingThrottle = t;
  pendingSteering = s;
  hasPendingDrive = true;

  uint32_t now = millis();
  if (now - lastDriveSentMs >= DRIVE_SEND_INTERVAL_MS) {
    sendDriveNow(t, s);
    hasPendingDrive = false;
  }
}

static void flushPendingDrive() {
  if (!hasPendingDrive) {
    return;
  }
  if (millis() - lastDriveSentMs < DRIVE_SEND_INTERVAL_MS) {
    return;
  }
  sendDriveNow(pendingThrottle, pendingSteering);
  hasPendingDrive = false;
}

static void sendStop() {
  if (!robotForwardEnabled) {
    lastRobotError = "robot forward disabled";
    throttle = 0;
    steering = 0;
    driveActive = false;
    pendingThrottle = 0;
    pendingSteering = 0;
    hasPendingDrive = false;
    return;
  }

  // 停车命令允许跳过退避，尽量立即发给小车。
  bool directWasFresh = directAckFresh();
  bool directSent = sendDirectPacket(DIRECT_TYPE_STOP);
  lastDriveSentMs = millis();
  if (directSent && directWasFresh) {
    robotReachable = true;
    lastRobotResponseMs = millis();
    lastRobotError = "";
    throttle = 0;
    steering = 0;
    driveActive = false;
    pendingThrottle = 0;
    pendingSteering = 0;
    hasPendingDrive = false;
    return;
  }

  int code = 0;
  String err;
  bool ok = postRobot("/stop", code, err);
  lastHttpCode = code;
  if (ok) {
    robotReachable = true;
    lastRobotResponseMs = millis();
    lastRobotError = "";
  } else {
    robotReachable = false;
    lastRobotError = err.length() ? err : String("http ") + code;
  }
  throttle = 0;
  steering = 0;
  driveActive = false;
  pendingThrottle = 0;
  pendingSteering = 0;
  hasPendingDrive = false;
}

static void calibrateCenter() {
  Serial.println("请保持摇杆居中，正在校准...");
  delay(300);
  long sumX = 0;
  long sumY = 0;
  for (int i = 0; i < CALIB_SAMPLES; i++) {
    sumX += readAxis(PIN_JOY_X);
    sumY += readAxis(PIN_JOY_Y);
    delay(SAMPLE_INTERVAL_MS);
  }
  centerX = (int)(sumX / CALIB_SAMPLES);
  centerY = (int)(sumY / CALIB_SAMPLES);
  calXMin = min(calXMin, centerX - 100);
  calXMax = max(calXMax, centerX + 100);
  calYMin = min(calYMin, centerY - 100);
  calYMax = max(calYMax, centerY + 100);
  saveCalibration();
  Serial.printf("校准完成 centerX=%d centerY=%d\n", centerX, centerY);
}

static void resetEdgeCalibration() {
  centerX = DEFAULT_CENTER_X;
  centerY = DEFAULT_CENTER_Y;
  calXMin = DEFAULT_CAL_X_MIN;
  calXMax = DEFAULT_CAL_X_MAX;
  calYMin = DEFAULT_CAL_Y_MIN;
  calYMax = DEFAULT_CAL_Y_MAX;
}

static void saveCalibration() {
  prefs.putInt("ver", CALIBRATION_VERSION);
  prefs.putInt("cx", centerX);
  prefs.putInt("cy", centerY);
  prefs.putInt("xmin", calXMin);
  prefs.putInt("xmax", calXMax);
  prefs.putInt("ymin", calYMin);
  prefs.putInt("ymax", calYMax);
  prefs.putInt("rot", normalizeRotation(controlRotationDeg));
  prefs.putInt("mode", remoteAssistMode);
}

static void loadCalibration() {
  prefs.begin("joycal", false);
  if (prefs.getInt("ver", 0) != CALIBRATION_VERSION) {
    resetEdgeCalibration();
    saveCalibration();
    return;
  }
  centerX = prefs.getInt("cx", DEFAULT_CENTER_X);
  centerY = prefs.getInt("cy", DEFAULT_CENTER_Y);
  calXMin = prefs.getInt("xmin", DEFAULT_CAL_X_MIN);
  calXMax = prefs.getInt("xmax", DEFAULT_CAL_X_MAX);
  calYMin = prefs.getInt("ymin", DEFAULT_CAL_Y_MIN);
  calYMax = prefs.getInt("ymax", DEFAULT_CAL_Y_MAX);
  controlRotationDeg = normalizeRotation(prefs.getInt("rot", DEFAULT_CONTROL_ROTATION_DEG));
  remoteAssistMode = constrain(prefs.getInt("mode", 1), 1, 2);
}

static void recordEdge(const String& edge) {
  int sampleX = readAxis(PIN_JOY_X);
  int sampleY = readAxis(PIN_JOY_Y);
  if (edge == "center") {
    centerX = sampleX;
    centerY = sampleY;
  } else if (edge == "left") {
    calXMin = sampleX;
  } else if (edge == "right") {
    calXMax = sampleX;
  } else if (edge == "up") {
    calYMin = sampleY;
  } else if (edge == "down") {
    calYMax = sampleY;
  }

  if (calXMin > centerX) calXMin = centerX - 1;
  if (calXMax < centerX) calXMax = centerX + 1;
  if (calYMin > centerY) calYMin = centerY - 1;
  if (calYMax < centerY) calYMax = centerY + 1;
  saveCalibration();
}

