AI-FanGe/A-Ball-Robot-based-on-Esp32/physical_remote/esp32_joystick_remote/esp32_joystick_remote.ino
static String jsonStatus() {
  String json = "{";
  json += "\"ok\":true,";
  json += "\"device\":\"physical_remote\",";
  json += "\"driveMapping\":\"webui\",";
  json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"robot\":\"" + String(ROBOT_ESP32_IP) + "\",";
  json += "\"throttle\":" + String(throttle) + ",";
  json += "\"steering\":" + String(steering) + ",";
  json += "\"throttleRaw\":" + String(throttleRaw) + ",";
  json += "\"steeringRaw\":" + String(steeringRaw) + ",";
  json += "\"physicalNormX\":" + String(physicalNormX, 1) + ",";
  json += "\"physicalNormY\":" + String(physicalNormY, 1) + ",";
  json += "\"normX\":" + String(normX, 1) + ",";
  json += "\"normY\":" + String(normY, 1) + ",";
  json += "\"vectorMag\":" + String(vectorMag, 1) + ",";
  json += "\"filterAlpha\":" + String(JOYSTICK_FILTER_ALPHA, 2) + ",";
  json += "\"outputHoldDelta\":" + String(JOYSTICK_OUTPUT_HOLD_DELTA) + ",";
  json += "\"driveActive\":" + String(driveActive ? "true" : "false") + ",";
  json += "\"buttonPressed\":" + String(buttonPressed ? "true" : "false") + ",";
  json += "\"robotForwardEnabled\":" + String(robotForwardEnabled ? "true" : "false") + ",";
  json += "\"controlRotationDeg\":" + String(normalizeRotation(controlRotationDeg)) + ",";
  json += "\"remoteAssistMode\":" + String(remoteAssistMode) + ",";
  json += "\"centerX\":" + String(centerX) + ",";
  json += "\"centerY\":" + String(centerY) + ",";
  json += "\"calXMin\":" + String(calXMin) + ",";
  json += "\"calXMax\":" + String(calXMax) + ",";
  json += "\"calYMin\":" + String(calYMin) + ",";
  json += "\"calYMax\":" + String(calYMax) + ",";
  json += "\"rawX\":" + String(rawX) + ",";
  json += "\"rawY\":" + String(rawY) + ",";
  json += "\"deadZone\":" + String(DEAD_ZONE) + ",";
  json += "\"robotReachable\":" + String(robotReachable ? "true" : "false") + ",";
  json += "\"lastHttpCode\":" + String(lastHttpCode) + ",";
  json += "\"wifiStatus\":" + String((int)WiFi.status()) + ",";
  json += "\"wifiReconnectCount\":" + String(wifiReconnectCount) + ",";
  json += "\"driveSentCount\":" + String(driveSentCount) + ",";
  json += "\"driveFailCount\":" + String(driveFailCount) + ",";
  json += "\"driveSkipCount\":" + String(driveSkipCount) + ",";
  json += "\"directReady\":" + String(directReady ? "true" : "false") + ",";
  json += "\"directPeerKnown\":" + String(directPeerKnown ? "true" : "false") + ",";
  json += "\"directAckFresh\":" + String(directAckFresh() ? "true" : "false") + ",";
  json += "\"directPeer\":\"" + macToString(directPeerMac) + "\",";
  json += "\"directSendCount\":" + String(directSendCount) + ",";
  json += "\"directFailCount\":" + String(directFailCount) + ",";
  json += "\"directAckCount\":" + String(directAckCount) + ",";
  json += "\"directBadCount\":" + String(directBadCount) + ",";
  json += "\"directLastSendMs\":" + String(directLastSendMs) + ",";
  json += "\"directLastAckMs\":" + String(directLastAckMs) + ",";
  json += "\"directLastAckSeq\":" + String(directLastAckSeq) + ",";
  json += "\"directPeerResetCount\":" + String(directPeerResetCount) + ",";
  json += "\"voiceAudioEnabled\":" + String(VOICE_AUDIO_ENABLED ? "true" : "false") + ",";
  json += "\"voiceMicReady\":" + String(voiceMicReady ? "true" : "false") + ",";
  json += "\"voiceWsReady\":" + String(voiceWsReady ? "true" : "false") + ",";
  json += "\"voiceStreamEnabled\":" + String(voiceStreamEnabled ? "true" : "false") + ",";
  json += "\"voiceAudioSentCount\":" + String(voiceAudioSentCount) + ",";
  json += "\"voiceAudioFailCount\":" + String(voiceAudioFailCount) + ",";
  json += "\"voiceLastChunkMs\":" + String(voiceLastChunkMs) + ",";
  json += "\"voiceLastMessage\":\"" + jsonEscape(voiceLastMessage) + "\",";
  json += "\"lastRobotAttemptMs\":" + String(lastRobotAttemptMs) + ",";
  json += "\"updatedAt\":" + String(millis()) + ",";
  json += "\"lastRobotError\":\"" + jsonEscape(lastRobotError) + "\"";
  json += "}";
  return json;
}

static void handleStatus() {
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

static void handleStopHttp() {
  sendStop();
  server.send(200, "application/json; charset=utf-8", "{\"ok\":true,\"stopped\":true}");
}

static void handleRecalibrate() {
  calibrateCenter();
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

static void handleCalibrateEdge() {
  if (!server.hasArg("edge")) {
    server.send(400, "application/json; charset=utf-8", "{\"ok\":false,\"error\":\"missing edge\"}");
    return;
  }

  String edge = server.arg("edge");
  if (edge != "center" && edge != "left" && edge != "right" && edge != "up" && edge != "down") {
    server.send(400, "application/json; charset=utf-8", "{\"ok\":false,\"error\":\"invalid edge\"}");
    return;
  }

  recordEdge(edge);
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

static void handleCalibrationReset() {
  resetEdgeCalibration();
  saveCalibration();
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

static void handleForward() {
  if (server.hasArg("enabled")) {
    robotForwardEnabled = server.arg("enabled").toInt() != 0;
    robotReachable = false;
    driveFailCount = 0;
    driveSkipCount = 0;
    lastRobotError = robotForwardEnabled ? "robot forward enabled" : "robot forward disabled";
    if (robotForwardEnabled) {
      sendConfigToRobot();
    }
  }
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

static void handleOrientation() {
  if (server.hasArg("rotate")) {
    controlRotationDeg = normalizeRotation(server.arg("rotate").toInt());
    saveCalibration();
  }
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

static void handleMode() {
  if (server.hasArg("assistMode")) {
    remoteAssistMode = constrain(server.arg("assistMode").toInt(), 1, 2);
    saveCalibration();
    sendConfigToRobot();
  } else if (server.hasArg("toggle") && server.arg("toggle").toInt() != 0) {
    toggleAssistMode();
  }
  server.send(200, "application/json; charset=utf-8", jsonStatus());
}

