AI-FanGe/A-Ball-Robot-based-on-Esp32/physical_remote/esp32_joystick_remote/esp32_joystick_remote.ino
static void setupHttp() {
  server.on("/status", HTTP_GET, handleStatus);
  server.on("/stop", HTTP_POST, handleStopHttp);
  server.on("/stop", HTTP_GET, handleStopHttp);
  server.on("/recalibrate", HTTP_POST, handleRecalibrate);
  server.on("/recalibrate", HTTP_GET, handleRecalibrate);
  server.on("/calibrate-edge", HTTP_POST, handleCalibrateEdge);
  server.on("/calibrate-edge", HTTP_GET, handleCalibrateEdge);
  server.on("/calibration-reset", HTTP_POST, handleCalibrationReset);
  server.on("/calibration-reset", HTTP_GET, handleCalibrationReset);
  server.on("/forward", HTTP_POST, handleForward);
  server.on("/forward", HTTP_GET, handleForward);
  server.on("/orientation", HTTP_POST, handleOrientation);
  server.on("/orientation", HTTP_GET, handleOrientation);
  server.on("/mode", HTTP_POST, handleMode);
  server.on("/mode", HTTP_GET, handleMode);
  server.onNotFound([]() {
    server.send(404, "application/json; charset=utf-8", "{\"ok\":false,\"error\":\"not found\"}");
  });
  server.begin();
  Serial.println("HTTP 服务已启动 :80");
}

static void startMdnsIfNeeded() {
  if (mdnsStarted || WiFi.status() != WL_CONNECTED) {
    return;
  }
  uint32_t now = millis();
  if (lastMdnsAttemptMs != 0 && now - lastMdnsAttemptMs < MDNS_RETRY_MS) {
    return;
  }
  lastMdnsAttemptMs = now;
  if (MDNS.begin(REMOTE_HOSTNAME)) {
    MDNS.addService("http", "tcp", 80);
    mdnsStarted = true;
    Serial.print("遥控器 mDNS: http://");
    Serial.print(REMOTE_HOSTNAME);
    Serial.println(".local");
  } else {
    Serial.println("遥控器 mDNS 启动失败");
  }
}

static void connectWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);
  WiFi.setSleep(false);
  if (USE_STATIC_IP) {
    WiFi.config(localIp, gateway, subnet, dns1);
  }
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.print("连接 WiFi");
  uint32_t startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < WIFI_CONNECT_TIMEOUT_MS) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();
  if (WiFi.status() != WL_CONNECTED) {
    lastRobotError = "wifi connect timeout";
    Serial.println("WiFi 连接超时，继续启动并在后台重连");
    return;
  }
  Serial.print("遥控器 IP: ");
  Serial.println(WiFi.localIP());
  startMdnsIfNeeded();
  Serial.print("小车地址: http://");
  Serial.print(ROBOT_ESP32_IP);
  Serial.println("/drive");
}

static void maintainWiFi() {
  if (WiFi.status() == WL_CONNECTED) {
    startMdnsIfNeeded();
    if (!directReady) {
      setupDirectNow();
    }
    return;
  }

  robotReachable = false;
  if (mdnsStarted) {
    MDNS.end();
    mdnsStarted = false;
  }
  if (voiceWsReady) {
    wsVoice.close();
    voiceWsReady = false;
    voiceStreamEnabled = false;
  }

  uint32_t now = millis();
  if (now - lastWifiReconnectAttemptMs < WIFI_RECONNECT_INTERVAL_MS) {
    return;
  }
  lastWifiReconnectAttemptMs = now;
  wifiReconnectCount++;
  lastRobotError = "wifi reconnecting";
  Serial.println("WiFi 已断开，尝试重连...");
  WiFi.disconnect(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
}

void setup() {
  Serial.begin(115200);
  delay(200);

  pinMode(PIN_JOY_SW, INPUT_PULLUP);
  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  loadCalibration();
  connectWiFi();
  setupDirectNow();
  if (VOICE_AUDIO_ENABLED) {
    qAudio = xQueueCreate(10, sizeof(AudioChunk));
  }
  initVoiceMic();
  setupVoiceWebSocketCallbacks();
  Serial.printf(
    "已加载摇杆校准 center=(%d,%d) x=(%d,%d) y=(%d,%d)\n",
    centerX,
    centerY,
    calXMin,
    calXMax,
    calYMin,
    calYMax
  );
  setupHttp();
  if (VOICE_AUDIO_ENABLED) {
    xTaskCreatePinnedToCore(taskVoiceMicCapture, "voice_cap", 4096, nullptr, 2, nullptr, 0);
    xTaskCreatePinnedToCore(taskVoiceMicUpload, "voice_upl", 4096, nullptr, 2, nullptr, 0);
  }
}

void loop() {
  server.handleClient();
  maintainWiFi();
  maintainVoiceSocket();

  rawX = readAxis(PIN_JOY_X);
  rawY = readAxis(PIN_JOY_Y);
  buttonPressed = digitalRead(PIN_JOY_SW) == LOW;
  bool wasDriveActive = driveActive;
  uint32_t now = millis();
  if (buttonPressed && !lastButtonPressed) {
    buttonPressedAtMs = now;
    buttonLongPressHandled = false;
  }
  if (buttonPressed && !buttonLongPressHandled && (now - buttonPressedAtMs) >= BUTTON_CENTER_CAL_MS) {
    buttonLongPressHandled = true;
    calibrateCenter();
  }
  if (!buttonPressed && lastButtonPressed) {
    uint32_t pressedFor = now - buttonPressedAtMs;
    if (!buttonLongPressHandled && pressedFor >= BUTTON_DEBOUNCE_MS && pressedFor < BUTTON_CENTER_CAL_MS) {
      setAbsForwardNow();
    } else if (!buttonLongPressHandled && pressedFor >= BUTTON_CENTER_CAL_MS) {
      calibrateCenter();
    }
  }
  lastButtonPressed = buttonPressed;

  int t = 0;
  int s = 0;
  mapJoystickToDrive(rawX, rawY, t, s);  // 始终更新物理孪生数据 normX/normY

  bool shouldSendDrive = false;
  bool shouldSendStop = false;
  if (buttonPressed) {
    throttle = 0;
    steering = 0;
    driveActive = false;
  } else {
    throttle = t;
    steering = s;
    bool active = !(t == 0 && s == 0);
    driveActive = active;
    shouldSendDrive = active;
    shouldSendStop = !active && wasDriveActive;
  }

  // 先更新串口/WebUI 可见状态，再尝试网络发送，避免小车不可达拖慢本地反馈。
  maybePrintDriveStatus();
  maybeSendDirectDiscovery();
  maintainVoiceSocket();
  server.handleClient();

  if (!robotForwardEnabled) {
    hasPendingDrive = false;
    pendingThrottle = throttle;
    pendingSteering = steering;
  } else if (shouldSendStop) {
    sendStop();
  } else if (shouldSendDrive) {
    queueDrive(throttle, steering);
  }

  if (driveActive && now - lastKeepaliveMs >= DRIVE_KEEPALIVE_MS) {
    lastKeepaliveMs = now;
    sendDriveNow(throttle, steering);
  }
  flushPendingDrive();
  maintainVoiceSocket();

  delay(10);
}
